<template>
    <div class="introduction-container">
      <div class="introduction-container2"><h3>자기 소개서</h3></div>
      <fieldset><legend>인사</legend>
      <ul>
        안녕하세요! 저는 강민형이라고 합니다. 
        가천대학교에서 컴퓨터공학과를 전공하였으며, 
        '강한 적응력'과 '뛰어난 협업 능력'을 바탕으로 국가와 사회에 봉사 및 기여할 수 있는 인재가 되기 위해 노력하고 있습니다.
      </ul>
    </fieldset>
      <fieldset><legend>성장 배경</legend>
        <ul>
      저는 어린 시절 가난한 환경에서 자란 경험이 있어, 
      어떠한 상황에서도 적응할 수 있는 강한 적응력을 갖추게 되었습니다. 
      이런 경험은 제게 더 강인하게 성장하고 도전에 더 열린 마음을 갖게 해 주었습니다.
      <br><br>
      가난한 가정에서 자란 것은 어려운 순간들이 많았지만, 
      그 속에서 더 많은 것을 배울 수 있었습니다. 
      자원의 부족한 상태에서 창의적으로 문제를 해결하는 능력을 키우게 되었고, 
      어려움을 이겨내는 강한 의지와 인내력을 기를 수 있었습니다.
      <br><br>
      이러한 경험을 통해 배운 가장 중요한 것은 어떤 환경에서도 긍정적으로 생각하고, 
      어려움에도 불구하고 꿈을 향해 나아갈 수 있다는 것입니다. 
      이러한 강인함과 긍정적인 마음가짐을 업무에 적용하여 팀 내에서 협력하고 문제를 해결하는 데 기여하고 싶습니다.
      <br><br>
      끊임없이 배우고 발전하며, 
      어떤 환경에서도 성공할 수 있는 열정을 가지고 있습니다. 
      제 강점을 활용하여 회사에 기여할 기회가 주어진다면, 
      최선의 노력으로 일에 임하겠습니다.
      </ul>
    </fieldset>
      <fieldset><legend>취미와 특기</legend>
        <ul>
      저는 항상 새로운 도전을 하는 것을 즐기는 편입니다. 
      어린 시절부터 축구라는 스포츠와의 만남은 제게 무한한 활력과 열정을 주었습니다. 
      축구는 그뿐만이 아니라 팀워크, 리더십, 그리고 끊임없이 발전하려는 자세를 배울 수 있는 기회를 제게 주었습니다.
      <br><br>
팀워크에 대해 좀 더 이야기해 보자면, 
축구에서는 상대방을 이기기 위해서 팀원들과의 협력과 소통이 필수적입니다. 
이러한 협력 및 소통 능력은 회사 생활을 하는데 있어서도 저의 큰 강점 중 하나라고 생각합니다.
<br><br>
또한, 축구에서는 승패와 상관없이 끊임없는 노력과 훈련이 필요합니다. 
이를 통해 무엇이든 성취하기 위해서는 노력과 투지가 필요하다는 것을 깨닫게 되었습니다. 
업무에 있어서도 목표를 달성하기 위해 노력하고 지속적으로 발전하는 자세를 갖고 있습니다.
<br><br>
또한, 축구에서는 팀 내에서 리더십을 발휘하고 상황에 빠르게 대처해야 하는 상황들이 있었습니다. 
이를 통해 변화에 대한 적응력과 문제 해결 능력을 키웠습니다. 
이러한 강점들을 바탕으로 회사에서의 업무에 적극적으로 참여하고 성과를 만들어낼 수 있을 것입니다.
      </ul>
    </fieldset>
      <fieldset><legend>입사 지원 동기</legend>
        <ul>
      저는 지속적인 성장과 혁신을 추구하는 회사인 APPLE에 지원하게 되어 매우 기쁘게 생각합니다.
      <br><br>
      APPLE은 현대 비즈니스 환경에서 높은 품질의 제품과 서비스를 제공하며, 
      지속적인 혁신과 고객 중심의 가치 창출을 목표로 하고 있습니다. 
      이러한 비전과 목표는 제가 중요하게 여기는 가치와 깊은 공감을 일으킵니다.
      <br><br>
특히 APPLE이 추구하는 가치 중에서 '다양성'과 같은 가치는 제가 가진 능력과 함께 발전할 수 있는 것이라고 생각합니다. 
제 전문성과 열정을 통해 APPLE의 성장에 기여하고 싶습니다.
<br><br>
APPLE의 업계 리더로서의 입지와 명성은 제가 꿈꾸던 환경입니다. 
APPLE의 독특한 비즈니스 전략과 차별화된 서비스에 기반하여, 
제가 가진 역량을 최대한 발휘할 수 있을 것으로 기대합니다.
<br><br>
또한, APPLE의 기업 문화와 업무철학에 깊은 공감을 느껴, 
함께 일하고 성장하는 과정에서 지혜와 경험을 향상시키고 싶습니다.
<br><br>
제 뛰어난 문제 해결 능력과 팀원 간의 원활한 커뮤니케이션 능력을 통해 APPLE의 목표 달성에 기여하겠습니다. 
저의 열정과 전문성을 APPLE에서 펼칠 수 있는 기회를 부여해주셔서 감사하며, 
연락을 기다리고 있습니다.
<br><br>
감사합니다.
      </ul>
    </fieldset>
    </div>
    </template>

  <style scoped>
  .introduction-container {
    max-width: 800px;
    margin: 30px auto;
    border: 3px solid orange;
    border-radius: 10px;
    background-color: white;
  }
  
  .introduction-container h3 {
    color: white;
    font-size: 30px;
  }

  .introduction-container2 {
    background-color: orange;
    padding: 5px;
    text-align: center;
  }

  fieldset {
    margin: 20px;
    border: 1px solid #ddd;
    padding: 15px;
    border-radius: 5px;
  }
  
  legend {
    font-size: 1.2em;
    font-weight: bold;
  }
  
  ul {
    list-style-type: none;
  }
</style>