<template>
  <div id ="selfIntro">
    <div class ="division">
      <h3>성장과정은 본인의 특별한 점을 부각</h3>
      <p>
        '저는 20xx년도에 태어나 부모와 형제자매...' 이런 식의 틀에 박힌 성장과정은, 
        하루에도 수십 수백의 이력서와 자기소개서를 읽는 인사담당자에게는 전혀 
        어필하지 못하는, 글자 수를 맞추기 위한 느낌 밖에 줄 수 없습니다. 
        본인이 제일 중요시 하는 가치관을 중심으로 서술하세요. 
        꼭 시간순서일 필요는 없습니다. 그렇다고 무모하게 소설을 쓴다거나 있지도 않은 이야기를 쓰는 등 
        늠 하지는 마세요. 기업이 원하는 인재임을 드러내는 것으로 충분합니다.
      </p>
    </div>
      
    <div class ="division">
      <h3>둘째로, '취미와 특기' 입니다. </h3>
      <p>
        취미와 특기가 입사를 한 후 팀이나 회사에 잘 적응할 수 있는 인물인지를 평가한다 
        '독서'와 같은 뻔한 취미 말고 물론 책을 정말 다독한다든지,  
        특정 테마의 독서를 많이해서 그것을 회사가 가진 가치관과 연결시킬 수 있다면 써도 상관없습니다. 
        이런 경우 정말 취미가 독서인 경우이겠죠. 
        활동적이거나, 팀워크를 발휘할 수 있는 취미면 더욱 좋습니다. 
        운동 쪽이 좋고 '스카이다이빙' 같은 한두번 경험삼아 해본 액티비티가 아닌 
        주기적으로 할 수 있는 것 중에서 단체활동이 포함된 것이 
        긍정적인 이미지를 심어줄 가능성이 높습니다.
      </p>
    </div>
      
    <div class ="division">
      <h3>'입사지원동기' 쓰는 법입니다. </h3>
      <p>
        대부분의 인사담당자는 입사지원동기만 읽고 정말 회사에 입사하고 싶은 
        열망과 준비가 되어있는지 판단할 수 있습니다. 
        그만큼 이력서와 자기소개서에서 가장 중요한 항목이라고 생각합니다. 
        입사지원동기는 회사의 비전과 영업활동에 대한 파악이 먼저 있어야 합니다. 
        회사는 저마다의 비전, 미션, 목표를 가지고 있습니다. 
        회사 홈페이지에 가면 쉽게 확인이 가능합니다. 
        그리고 회사의 중장기적인 발전방향은 뉴스나 기타자료 등을 조금만 살펴보면 알 수 있습니다.
        자신이 가진 능력을 펼칠 수 있는 장이라는 것을 보여주세요.  
        회사가 가진, 그리고 회사가 추구하는 가치관과 본인의 능력이 많은 부분을 공유할 수 있다고 
        자신있게 말해주세요. 
        그냥 여러 곳에 구인구직을 하다가 입사지원서를 넣었다라고 생각하며 
        쓴 입사지원동기는 특징이 없고, '꼭 이 회사일 필요는 없다'는 인식을 심어줍니다. 
        다른 항목은 몰라도 반드시 입사지원동기는 회사와 지원하는 부서에 맞게 맞춤작성하셔야 합니다. 
      </p>
    </div>

    <div class ="division">
      <h3>포부 및 장래계획 쓰는법입니다. </h3>
      <p>
        신규채용의 경우 신입사원을 뽑는 것이기에 조금 당돌하다 
        싶을 정도로 포부를 밝히는 것도 괜찮습니다. 
        이 항목의 경우 회사에서 임원이 되겠다는 일반적인 목표도 나쁘지는 않습니다. 
        다만 어떤 지원자는 지나치게 솔직해서 
        2,3년 경력을 쌓고 더 넓은 곳에서 꿈을 펼치겠다고 하는 분들도 있는데, 
        절대 금물입니다. 
        회사에 뼈를 묻겠다 정도 까지는 아니더라도 회사에서 많이 배우고, 
        회사에서 많이 활용할 수 있는 인재라는 인식을 품게 해야 합니다.
      </p>  
    </div>
 
    <div class ="division">
      <h3>절대 지켜야할 것들 - 글자수, 오탈자</h3>
      <p>
        오탈자에 대한 검토는 여러번 하세요. 
        자소서 무료첨삭을 하다가 보면, 
        줄간격도 맞추지 않고 심지어 오탈자가 한페이지에 4,5개씩 나오는 분들이 계십니다. 
        맞춤법을 틀리는 것은 본인의 지식수준을 나타낸다고 한다면, 
        오자가 많은 자소서를 그대로 제출한다는 것은 지원 자체의 간절함이 없고 
        성의가 없는 지원자임을 나타내는 것입니다. 
        오탈자 검토를 하지도 않고 제출하는 것보다는 
        차라리 제출하지 않는 것이 낫다고 봅니다. 
  
        글자수에 대한 기준은 반드시 지키세요. 
        요즘은 인터넷으로 일정 글자수가 넘어가면 더 이상 입력이 되지 않는 경우가 많습니다. 
        그렇다고 1,500자 기준에 500자 정도만 작성하는 등 회사가 정해놓은 글자수에 지나치게 
        모자르거나, 지나치게 많은 것은 절대 좋지 않습니다. 
        자소서를 입력할 때 글자수 표시가 되지 않는다면, 
        맞춤법검사기와 띄어쓰기검사기, 그리고 글자수세기는 반드시 하고 제출하세요.
      </p>  
    </div>
  </div>
</template>

<style scoped>
  #selfIntro{
    font-size: 1em;
    border: 5pt groove #3f51b5;
    font-weight: bolder;
  }
  h3{
    color : red;
  }
  .division{
    margin-left: 100px ;
    margin-right: 100px ;
  }
  p{
    border: 3px dashed blue;
  }  
</style>