import React from 'react';
import './Internship.css';

const ExtraCurricularI = () => {
    return (
        <div className='ExtraCurricularI'>
            <h2>삼성 대학교 연계 인턴십 경험</h2>
            <p><img className='first-image' src="/images/150837_160034_4645.jpg" alt="사진!!!" /></p>
      <p>
      <h3>프로젝트 내용:</h3> 삼성 독자의 모바일 운영체제 개발 프로젝트에 참여했다. 
      단순히 개발에만 그치지 않고 애플처럼 상용화 할 수 있을 정도의 개발을 해내는 것이 프로젝트의 목표였다.
      </p>
      <p><h3>성과 및 결과:</h3>모바일 운영체제 개발이 주 업무였기 때문에 학부 과정때 공부했던 리눅스가 상당한 도움이 되었다.
      인턴십이었기에 막중한 엄무를 맡지는 않았으나 주로 개발쪽에 보조로 투입이 되었다.
      결과물을 내지는 못 하였으나 개발의 현장을 가까이서 지켜볼 수 있었으므로 개발의 단계가 어떻게 이루어지는지, 단계 별 디테일, 회사 내에서의 업무 방식 등을 배울 수 있었다.
      </p>
      <p><h3>느낀점:</h3> 수업 시간이나 자격증 공부를 하면서 진행했던 공부들과는 다르게 리눅스의 활용이 정말 깊은 수준으로 진행되었는데, 
      현장의 개발자분들은 완전히 관련된 지식을 몸에 체화된 채로 사는 듯해보였다. 
      이를 통해 나도 지금보다도 훨씬 더 열심히 공부해야겠다는 자극을 받을 수 있었다.
      또 개발의 단계에서 쉽지 않은 문제도 각자가 파트를 나눠 해결하는 모습을 보며 협력의 중요성을 깨달았다.
      </p>
        </div>
    );
};

export default ExtraCurricularI;