import React from 'react';
import './CollegeLife.css'

const CollegeLife = () => {
    return (
        <div className='CLDiv'>
      <p><h4>학생회 활동</h4>
       학생회로서 활동을 하면서 리더십과 협업 능력을 기를 수 있었습니다.
       <table>
        <tr><td>2024년 3학년 1학기</td><td>학생회 임원 활동</td></tr>
      </table>
      </p>
      <br></br>
      <p><h4>장학금 수여 내역</h4>
      2학년 1학기에 성적 전액 장학금을 수여한 것을 포함하여 교내외에서 시상하는 다양한 장학 프로그램에 참여하여 여러 장학 시스템의 수혜를 받았고
      이 과정에서 학업 외적으로도 다양한 분야에서 성장할 수 있는 기회를 많이 가졌습니다. 
      또한 이러한 경험이 나를 더욱 책임감 있고 목표 지향적인 개인으로 성장하게 했습니다.
      <table>
        <tr><td>2023년 2학년 2학기</td><td>직전 학기 성적 우수자<br></br>푸른 등대 기부 장학생</td></tr>
        <tr><td>2024년 3학년 1학기</td><td>푸른 등대 기부 장학생<br></br>멘토 프로그래밍 참여</td></tr>
        <tr><td>2024년 3학년 2학기</td><td>멘토 프로그래밍 참여</td></tr>
        <tr><td>2025년 4학년 1학기</td><td>멘토 프로그래밍 참여</td></tr>
      </table>
      </p>
      <br></br>
      <p><h5>근로 장학생 활동</h5>
      특히 근로 프로그램 중 근로 장학생으로서 다년간 학교에서 근무하며 여러 근로지에서 다양한 업무를 했습니다.
      <table>
        <tr><td>2023년 2학년 1학기</td><td>중앙 도서관 근로 장학생</td></tr>
        <tr><td>2023년 2학년 2학기</td><td>일반 대학원 근로 장학생</td></tr>
        <tr><td>2024년 3학년 1학기</td><td>중앙 도서관 근로 장학생</td></tr>
        <tr><td>2024년 3학년 2학기</td><td>중앙 도서관 근로 장학생</td></tr>
        <tr><td>2025년 4학년 1학기</td><td>코코네스쿨 근로 장학생</td></tr>
        <tr><td>2025년 4학년 2학기</td><td>과사무실 근로 장학생</td></tr>
      </table>
      </p>
      <br></br>
      <p><h4>동아리 활동</h4>
      대학 시절에 밴드부에 참여함으로써 창의적이고 협력적인 활동을 경험할 수 있었습니다. 
      밴드부에서는 음악적인 역량뿐만 아니라 팀원 간의 조화와 협업을 발전시키는 데 큰 역할을 했습니다. 
      컴퓨터공학과 동아리에서는 다양한 프로젝트와 대회 참가를 통해 문제 해결 능력과 프로그래밍 기술을 향상시켰습니다. 
      이러한 경험을 통해 창의적인 아이디어를 제안하고 효율적인 문제 해결 방법을 찾는 능력을 강화할 수 있었습니다. 
      또한, 팀원들과의 협업을 통해 다양한 배경과 관점을 이해하고 통합하는 능력을 길렀습니다.
      <table>
        <tr><td>2024년 3학년 1학기</td><td>밴드부</td></tr>
        <tr><td>2024년 3학년 2학기</td><td>컴퓨터공학과 동아리</td></tr>
        <tr><td>2025년 4학년 1학기</td><td>컴퓨터공학과 동아리</td></tr>
        <tr><td>2025년 4학년 2학기</td><td>컴퓨터공학과 동아리</td></tr>
      </table>
      </p>
        </div>
    );
};

export default CollegeLife;